RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_spi.c
        rt_uint8_t *aligned_send_buf = RT_NULL;
        rt_uint8_t *aligned_recv_buf = RT_NULL;

        rt_bool_t dma_eligible = (send_length >= BSP_SPI_DMA_TRANS_MIN_LEN);
#if defined(BSP_SPI_TX_USING_DMA)
        rt_bool_t use_tx_dma = dma_eligible && (spi_drv->spi_dma_flag & RT_DEVICE_FLAG_DMA_TX);
#else
        rt_bool_t use_tx_dma = RT_FALSE;
#endif /* BSP_SPI_TX_USING_DMA */
#if defined(BSP_SPI_RX_USING_DMA)
        rt_bool_t use_rx_dma = dma_eligible && (spi_drv->spi_dma_flag & RT_DEVICE_FLAG_DMA_RX);
#else
        rt_bool_t use_rx_dma = RT_FALSE;
#endif /* BSP_SPI_RX_USING_DMA */

        if (!scheduler_available || irq_disabled)
        {
            use_rx_dma = use_tx_dma = dma_eligible = RT_FALSE;
        }

        if (dma_eligible)
        {
#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F7)
            const rt_uint8_t align_size = 32;
#else
            const rt_uint8_t align_size = 4;
#endif
            /* Prepare DMA buffers only if the corresponding DMA will be used */
            if (send_buf && use_tx_dma && !RT_IS_ALIGN((rt_uint32_t)send_buf, align_size))
            {
                aligned_send_buf = rt_malloc_align(send_length, align_size);
                if (aligned_send_buf == RT_NULL)
                {
                    state = HAL_ERROR;
                    LOG_E("malloc aligned_send_buf failed!");
                    goto transfer_cleanup;
                }
                rt_memcpy(aligned_send_buf, send_buf, send_length);
                dma_send_buf = aligned_send_buf;
            }

            if (recv_buf && use_rx_dma && !RT_IS_ALIGN((rt_uint32_t)recv_buf, align_size))
            {
                aligned_recv_buf = rt_malloc_align(send_length, align_size);
                if (aligned_recv_buf == RT_NULL)
                {
                    state = HAL_ERROR;
                    LOG_E("malloc aligned_recv_buf failed!");
                    goto transfer_cleanup;
                }
                dma_recv_buf = aligned_recv_buf;
            }

#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F7)
            // D-Cache maintenance for buffers that will be used by DMA
            if (dma_send_buf) rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, (void *)dma_send_buf, send_length);
            if (dma_recv_buf) rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, dma_recv_buf, send_length);
#endif
        }
#endif /* BSP_SPI_USING_DMA */

#ifdef BSP_SPI_USING_INT
        rt_bool_t int_eligible = (send_length >= BSP_SPI_INT_TRANS_MIN_LEN);
#if defined(BSP_SPI_TX_USING_INT)
        rt_bool_t use_tx_int = int_eligible && spi_drv->spi_dma_flag & RT_DEVICE_FLAG_INT_TX;
#else
        rt_bool_t use_tx_int = RT_FALSE;
#endif /* BSP_SPI_TX_USING_INT */
#if defined(BSP_SPI_RX_USING_INT)
        rt_bool_t use_rx_int = int_eligible && spi_drv->spi_dma_flag & RT_DEVICE_FLAG_INT_RX;
#else
        rt_bool_t use_rx_int = RT_FALSE;
#endif /* BSP_SPI_RX_USING_INT */
        if (!scheduler_available || irq_disabled)
        {
            use_rx_int = use_tx_int = int_eligible = RT_FALSE;
        }
#endif /* BSP_SPI_USING_INT */

        rt_bool_t async_started = RT_TRUE;
#ifdef BSP_SPI_USING_IRQ
        /* Ensure that the current completion volume is solely associated with the current affairs.*/
        rt_completion_init(&spi_drv->cpt);
#endif /* BSP_SPI_USING_IRQ */
        /* Start data exchange in full-duplex DMA mode. */
        if (message->send_buf && message->recv_buf)
        {
#ifdef BSP_SPI_USING_DMA
            if (use_tx_dma && use_rx_dma)
            {
                state = HAL_SPI_TransmitReceive_DMA(spi_handle, (uint8_t *)dma_send_buf, dma_recv_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_DMA */
#ifdef BSP_SPI_USING_INT
            if (use_tx_int && use_rx_int)
            {
                state = HAL_SPI_TransmitReceive_IT(spi_handle, (uint8_t *)send_buf, recv_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_INT */
            {
                state = HAL_SPI_TransmitReceive(spi_handle, (uint8_t *)send_buf, recv_buf, send_length, timeout_ms);
                async_started = RT_FALSE;
            }
        }
        else if (message->send_buf)
        {
#ifdef BSP_SPI_USING_DMA
            if (use_tx_dma)
            {
                state = HAL_SPI_Transmit_DMA(spi_handle, (uint8_t *)dma_send_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_DMA */
#ifdef BSP_SPI_USING_INT
            if (use_tx_int)
            {
                state = HAL_SPI_Transmit_IT(spi_handle, (uint8_t *)send_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_INT */
            {
                state = HAL_SPI_Transmit(spi_handle, (uint8_t *)send_buf, send_length, timeout_ms);
                async_started = RT_FALSE;
            }
        }
        else if (message->recv_buf)
        {
            /* clear the old error flag */
            __HAL_SPI_CLEAR_OVRFLAG(spi_handle);
#ifdef BSP_SPI_USING_DMA
            rt_memset(dma_recv_buf, 0xFF, send_length);
            if (use_rx_dma)
            {
                state = HAL_SPI_Receive_DMA(spi_handle, dma_recv_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_DMA */
#ifdef BSP_SPI_USING_INT
            if (use_rx_int)
            {
                state = HAL_SPI_Receive_IT(spi_handle, recv_buf, send_length);
            }
            else
#endif /* BSP_SPI_USING_INT */
            {
                state = HAL_SPI_Receive(spi_handle, recv_buf, send_length, timeout_ms);
                async_started = RT_FALSE;
            }
        }
        else
        {
            state = HAL_ERROR;
            LOG_E("message->send_buf and message->recv_buf are both NULL!");
        }

        if (state != HAL_OK)
        {
            LOG_E("SPI transfer error: %d", state);
            message->length = 0;
            spi_handle->State = HAL_SPI_STATE_READY;
            goto transfer_cleanup;
        }

#ifdef BSP_SPI_USING_IRQ
        if (async_started)
        {
            /* blocking the thread,and the other tasks can run */
            if (rt_completion_wait(&spi_drv->cpt, timeout_tick) != RT_EOK)
            {
                state = HAL_TIMEOUT;
                need_abort = RT_TRUE;
                LOG_E("wait for SPI async transfer overtime!");
                goto transfer_cleanup;
            }

            if (spi_handle->ErrorCode != HAL_SPI_ERROR_NONE)
            {
                rt_uint32_t err = spi_handle->ErrorCode;
                rt_bool_t tx_only = (message->send_buf != RT_NULL) && (message->recv_buf == RT_NULL);
                rt_bool_t ovr_only = ((err & HAL_SPI_ERROR_OVR) != 0U) && ((err & ~(HAL_SPI_ERROR_OVR | HAL_SPI_ERROR_ABORT)) == 0U);

                /**
                 * Ignore the expected OVR from a completed Tx-only transfer.
                 *
                 * In 2-line SPI mode, Tx-only transfer still receives data from
                 * MISO. Since no RX buffer is provided, the received data is not
                 * read and HAL may latch OVR after async Tx completion.
                 */
                if (tx_only && ovr_only && (spi_handle->Init.Direction == SPI_DIRECTION_2LINES) && (spi_handle->TxXferCount == 0U))
                {
                    __HAL_SPI_CLEAR_OVRFLAG(spi_handle);
                    spi_handle->ErrorCode = HAL_SPI_ERROR_NONE;
                }
                else
                {
                    state = HAL_ERROR;
                    need_abort = RT_TRUE;
                    LOG_E("SPI async transfer failed, error code: 0x%08x", spi_handle->ErrorCode);
                    goto transfer_cleanup;
                }
            }
        }
#endif /* BSP_SPI_USING_IRQ */
        if (state == HAL_OK)
        {
            /* send-only */
            if (message->send_buf != RT_NULL && message->recv_buf == RT_NULL
            && message->cs_release && (device->config.mode & RT_SPI_3WIRE))
            {
                /* release the CS by disable SPI when using 3 wires SPI */
                __HAL_SPI_DISABLE(spi_handle);
            }
            LOG_D("%s transfer done", spi_drv->config->bus_name);
        }

transfer_cleanup:
        if (need_abort)
        {
            if (HAL_SPI_Abort(spi_handle) != HAL_OK)
            {
                LOG_W("abort SPI async transfer failed, state: %d, error: 0x%08x",
                      HAL_SPI_GetState(spi_handle),
                      spi_handle->ErrorCode);
            }
        }
#ifdef BSP_SPI_USING_DMA
        /* Post-transfer processing */
        if (state == HAL_OK)
        {
            if (aligned_recv_buf != RT_NULL)
            {
#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F7)
                rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, aligned_recv_buf, send_length);
#endif
                rt_memcpy(recv_buf, aligned_recv_buf, send_length);
            }
        }

        // Free any temporary buffers that were allocated
        if (aligned_send_buf) rt_free_align(aligned_send_buf);
        if (aligned_recv_buf) rt_free_align(aligned_recv_buf);
#endif /* BSP_SPI_USING_DMA */
        if (state != HAL_OK)
        {
            break;
        }
    }

    if (message->cs_release && !(device->config.mode & RT_SPI_NO_CS) && (device->cs_pin != PIN_NONE))
    {
        if (device->config.mode & RT_SPI_CS_HIGH)
            rt_pin_write(device->cs_pin, PIN_LOW);
        else
            rt_pin_write(device->cs_pin, PIN_HIGH);
    }

