RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_spi.c
    if(state != HAL_OK)
    {
        return -RT_ERROR;
    }
    return message->length;
}

static rt_err_t spi_configure(struct rt_spi_device *device,
                              struct rt_spi_configuration *configuration)
{
    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(configuration != RT_NULL);

    struct stm32_spi *spi_drv =  rt_container_of(device->bus, struct stm32_spi, spi_bus);
    spi_drv->cfg = configuration;

    return stm32_spi_init(spi_drv, configuration);
}

static const struct rt_spi_ops stm_spi_ops =
{
    .configure = spi_configure,
    .xfer = spixfer,
};

static int rt_hw_spi_bus_init(void)
{
    rt_err_t result;

    for (rt_size_t i = 0; i < sizeof(spi_config) / sizeof(spi_config[0]); i++)
    {
        spi_bus_obj[i].config = &spi_config[i];
        spi_bus_obj[i].spi_bus.parent.user_data = &spi_config[i];
        spi_bus_obj[i].handle.Instance = spi_config[i].Instance;

#ifdef BSP_SPI_USING_IRQ
        /* initialize completion object */
        rt_completion_init(&spi_bus_obj[i].cpt);
#endif /* BSP_SPI_USING_IRQ */

        result = rt_spi_bus_register(&spi_bus_obj[i].spi_bus, spi_config[i].bus_name, &stm_spi_ops);
        RT_ASSERT(result == RT_EOK);

        LOG_D("%s bus init done", spi_config[i].bus_name);
    }

    return result;
}

/**
  * Attach the spi device to SPI bus, this function must be used after initialization.
  */
rt_err_t rt_hw_spi_device_attach(const char *bus_name, const char *device_name, rt_base_t cs_pin)
{
    RT_ASSERT(bus_name != RT_NULL);
    RT_ASSERT(device_name != RT_NULL);

    rt_err_t result;
    struct rt_spi_device *spi_device;

    /* attach the device to spi bus*/
    spi_device = (struct rt_spi_device *)rt_malloc(sizeof(struct rt_spi_device));
    RT_ASSERT(spi_device != RT_NULL);

    result = rt_spi_bus_attach_device_cspin(spi_device, device_name, bus_name, cs_pin, RT_NULL);
    if (result != RT_EOK)
    {
        LOG_E("%s attach to %s faild, %d\n", device_name, bus_name, result);
    }

    RT_ASSERT(result == RT_EOK);

    LOG_D("%s attach to %s done", device_name, bus_name);

    return result;
}

/**
  * Detach the spi device from SPI bus.
  *
  * @param device_name the name of the spi device to be detached.
  */
rt_err_t rt_hw_spi_device_detach(const char *device_name)
{
    RT_ASSERT(device_name != RT_NULL);

    rt_err_t result;
    struct rt_spi_device *spi_device;

    rt_device_t device = rt_device_find(device_name);
    if (device == RT_NULL)
    {
        LOG_E("SPI device %s not found.", device_name);
        return -RT_ERROR;
    }

    if (device->type != RT_Device_Class_SPIDevice)
    {
        LOG_E("%s is not an SPI device.", device_name);
        return -RT_ERROR;
    }

    spi_device = (struct rt_spi_device *)device;

    result = rt_spi_bus_detach_device_cspin(spi_device);
    if (result != RT_EOK)
    {
        LOG_E("Failed to detach %s from its bus, error code: %d", device_name, result);
        return result;
    }

    rt_free(spi_device);

    LOG_D("SPI device %s has been detached.", device_name);

    return RT_EOK;
}

#if defined(BSP_USING_SPI1) && defined(BSP_SPI1_USING_IRQ)
void SPI1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI1_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_SPI1_RX_USING_DMA
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI1_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI1_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_SPI1_RX_USING_DMA */

#ifdef BSP_SPI1_TX_USING_DMA
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI1_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI1_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_SPI1_TX_USING_DMA */
#endif /* defined(BSP_USING_SPI1) && defined(BSP_SPI1_USING_IRQ) */

#if defined(BSP_USING_SPI2) && defined(BSP_SPI2_USING_IRQ)
void SPI2_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI2_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_SPI2_RX_USING_DMA
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI2_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI2_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_SPI2_RX_USING_DMA */

#ifdef BSP_SPI2_TX_USING_DMA
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI2_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI2_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_SPI2_TX_USING_DMA */
#endif /* defined(BSP_USING_SPI2) && defined(BSP_SPI2_USING_IRQ) */

#if defined(BSP_USING_SPI3) && defined(BSP_SPI3_USING_IRQ)
void SPI3_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_SPI_IRQHandler(&spi_bus_obj[SPI3_INDEX].handle);

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_SPI3_RX_USING_DMA
/**
  * @brief  This function handles DMA Rx interrupt request.
  * @param  None
  * @retval None
  */
void SPI3_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI3_INDEX].dma.handle_rx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_SPI3_RX_USING_DMA */

#ifdef BSP_SPI3_TX_USING_DMA
/**
  * @brief  This function handles DMA Tx interrupt request.
  * @param  None
  * @retval None
  */
void SPI3_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&spi_bus_obj[SPI3_INDEX].dma.handle_tx);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_SPI3_TX_USING_DMA */
#endif /* defined(BSP_USING_SPI3) && defined(BSP_SPI3_USING_IRQ) */

#if defined(BSP_USING_SPI4) && defined(BSP_SPI4_USING_IRQ)
void SPI4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

